{
  "bio": "Shavon Lloyd (b. 1997) is an award-winning composer, baritone, conductor, and music educator. As a young musician, Shavon has already had the opportunity to perform for a wide variety of audiences and compose for numerous ensembles from K-12 to professional groups.\n\nFrom Middletown, NY, Lloyd began his journey as a dedicated musician in 2014 when he won his first composition contest at the age of 17. His piece, \"Untitled\", was selected as the grand prize winner of the Manhattan Choral Ensemble's \"New Music for New York\" composition contest. After that moment, Lloyd solidified his decision in studying music at The Crane School of Music at SUNY Potsdam. Here he continued his compositional journey under the tutelage of Dr. David Heuser, winning a second contest in Washington, D.C. for his choral piece, \"So Breaks the Sun\", which was premiered by the 18th Street Singers in July of 2018. Since then Lloyd, has been commissioned for works at the K-12 levels, collegiate choral programs, and established professional concert choirs. Recently, Shavon won a third composition contest in July 2019, sponsored by the Orpheus Chamber Singers in Dallas, Texas. In March 2020, the group premiered his work for double choir, \"Alleluia\". Since then, Lloyd has been commissioned by such groups as Cappella Festiva and The ABC Bel Canto Choir.\n\nShavon is an active participant in the New York State School Music Association (NYSSMA), contributing to both the Belonging, Equity, Diversity, and Representation (BEDR) Committee, and the Composition Committee. Regarding music education, his interests include student-centered learning through democracy and creativity in the music classroom. For the past three years, he has put this mindset into practice as the Vocal/General Music Teacher at Indian River High School in Philadelphia, NY.\n\nAs a baritone, Shavon has had the opportunity to perform alongside Patti LuPone, Lisa Vroman, Canadian Brass, and other professional soloists and ensembles. While studying with Dr. Lonel Woods, he became a 2-time winner of the CFLNY-NATS Singing Competition, and featured soloist throughout New York. At Crane, he had the pleasure of soloing in Vaughan Williams' Serenade to Music and Mozart's Mass in C minor under the baton of Maestros Duain Wolfe and Kent Tritle, respectively. In May 2020, Shavon won the Classical Singer Musical Theatre Competition for Pre-Professionals with his performance of \"Soliloquy\" from Rodgers and Hammerstein's Carousel. Lloyd is currently pursuing his Master of Music in Vocal Performance degree at The Juilliard School in New York City. Here, he has performed in multiple productions, including Händel's \"Atalanta\" (Nicandro - cover), Purcell's \"King Arthur\" (Grimbald/Cold Genius), and Puccini's \"Gianni Schicchi\" (Betto). Lloyd was recently selected to be a Gerdine Young Artist for The Opera Theatre of Saint Louis in 2023. He will be performing in Puccini's \"Tosca\" (Sacristan cover). He will also make his professional debut as Simon in an all-black production of Joplin's \"Treemonisha\", including a world premiere of Damien Sneed and Karen Chilton's prologue and epilogue detailing moments Joplin's life.",
  "condensed": "Shavon Lloyd (b. 1997) is an award-winning composer, baritone, conductor, and music educator whose works have been performed by professional choirs across the U.S., including the Orpheus Chamber Singers, 18th Street Singers, Cappella Festiva, and ABC Bel Canto Choir. A three-time national composition contest winner by age 22, his choral music has been praised for its emotional depth and clarity. In 2023, he was named a Gerdine Young Artist at Opera Theatre of Saint Louis, performing in Puccini’s Tosca and making his operatic debut as Simon in an acclaimed all-Black production of Joplin’s Treemonisha.\n\nAs a baritone, Lloyd has soloed with maestros Duain Wolfe and Kent Tritle, performed alongside Patti LuPone and Canadian Brass, and won top honors at both the CFLNY-NATS and Classical Singer Musical Theatre competitions. A committed educator and advocate for inclusive music-making, he serves on NYSSMA’s BEDR and Composition Committees, and previously taught at Indian River High School. He is currently pursuing his Master of Music at The Juilliard School."
}
